{
  "name": "Miled Mohamed Ameur",
  "logo_name": "Miled Mohamed Ameur",
  "role": "Full-stack developer",
  "about": {
    "sections": {
      "professional-info": {
        "title": "professional-info",
        "icon": "icons/info-professional.svg",
        "info": {
          "experience": {
            "title": "experience",
            "description": "<br>Over the past three years, I have developed numerous web and IoT applications while working as a freelance developer. This experience has not only honed my technical skills but also taught me efficient strategies that significantly enhance productivity. I am proficient in leveraging modern web technologies to streamline development processes and deliver robust solutions tailored to client needs."
          },
          "hard-skills": {
            "title": "hard-skills",
            "description": "<br>As a full-stack developer, I have gained expertise in various technologies and frameworks that enable me to create innovative web applications. My skill set includes:<br><br>Front-End Development:<br>React: Started with React to build dynamic user interfaces.<br>Next.js: Transitioned to Next.js to leverage its powerful features like server-side rendering and static site generation.<br>Tailwind CSS: Utilized Tailwind CSS to transform the task of writing CSS into an enjoyable and efficient process.<br><br>Back-End Development:<br>Prisma: Employed Prisma as my ORM for efficient database management.<br>Databases: Proficient in MySQL, with a strong preference for PostgreSQL due to its advanced features. Also experienced with NoSQL databases like Firebase.<br><br>Content Management:<br>Headless CMS: Used headless CMS solutions such as Sanity and Contentful for back-office management and content delivery."
          },
          "soft-skills": {
            "title": "soft-skills",
            "description": "<br>I thrive on problem-solving and am a fast learner who adapts quickly to various situations. I handle stress effectively, maintaining composure under pressure. My commitment to excellence drives me to consistently deliver outstanding results in both my personal and professional life."
          }
        }
      },
      "personal-info": {
        "title": "personal-info",
        "icon": "icons/info-personal.svg",
        "info": {
          "bio": {
            "title": "bio",
            "description": "<br> About me <br> Over the past three years, I have developed numerous web and IoT applications while working as a freelance developer. This experience has not only honed my technical skills but also taught me efficient strategies that significantly enhance productivity. I am proficient in leveraging modern web technologies to streamline development processes and deliver robust solutions tailored to client needs."
          },
          "interests": {
            "title": "interests",
            "description": "<br>In my free time, I enjoy tackling complex challenges and finding innovative solutions, a passion that extends beyond my professional work into my personal interests. I'm an avid music enthusiast, always exploring new genres and musical landscapes. I have a deep appreciation for cinema, enjoying films from various cultures and genres. Additionally, I engage in gaming as a way to unwind, enjoy storytelling, and connect with friends."
          },
          "education": {
            "title": "education",
            "description": "<br>",
            "files": {
              "university of monastir": "university of monastir"
            }
          }
        }
      },
      "hobbies-info": {
        "title": "hobbies-info",
        "icon": "icons/info-hobbies.svg",
        "info": {
            "music": {
                "title": "music",
                "description": "<br>Music is a significant part of my life, and I enjoy exploring various genres and artists. I find inspiration in the melodies and lyrics of different songs, which often influence my creative work. I am always on the lookout for new music to add to my collection and broaden my horizons."
            },
          "favorite-games": {
            "title": "favorite-games",
            "description": "<br>I have a deep appreciation for survival and post-apocalyptic games, where immersive storytelling and innovative gameplay take center stage. The Last of Us stands out for its gripping ambiance, meticulously crafted map design, and a narrative that transports players to another dimension, offering a profound sensory experience that leaves a lasting impact. Minecraft holds a special place for me as an eternal favorite. Every year, I eagerly return to its vast, blocky world, reliving the joy of exploration and creation with friends as if it were the first time. A Plague Tale captivated me with its exceptional storytelling and character development, complemented by gameplay that seamlessly blends stealth and narrative-driven exploration, creating an unforgettable gaming journey."
          }
        }
      }
    }
  },
  "contacts": {
    "direct": {
      "title": "contacts",
      "sources": {
        "email": "miledmohamedameur@isimm.u-monastir.tn",
        "phone": "+216 29 862 385"
      }
    },
    "social": {
      "github": {
        "title": "Github profile",
        "url": "https://github.com/MiledAmer",
        "user": "MiledAmer"
      },
      "facebook": {
        "title": "Facebook profile",
        "url": "https://facebook.com/",
        "user": "username"
      },
      "twitter": {
        "title": "Twitter account",
        "url": "https://twitter.com/",
        "user": "username"
      }
    }
  },
  "gists": {
    "1": "83861a67e377633ee8368df01ee3a355",
    "2": "694c1f32332788a2ac7f37b09e5aa40e"
  },
  "projects": {
    "1": {
      "title": "rental system",
      "description": "Duis aute irure dolor in velit esse cillum dolore.",
      "img": "/images/projects/ui-animations.png",
      "tech": ["React"],
      "url": "https://github.com/MiledAmer/bateau"
    },
    "2": {
      "title": "management system",
      "description": "Duis aute irure dolor in velit esse cillum dolore.",
      "img": "/images/projects/tetris-game.png",
      "tech": ["React"],
      "url": "https://github.com/MiledAmer/system-gestion"
    },
    "3": {
      "title": "eshop",
      "description": "Duis aute irure dolor in velit esse cillum dolore.",
      "img": "/images/projects/tetris-game.png",
      "tech": ["HTML"],
      "url": "https://github.com/MiledAmer/my-first-eshop"
    }
  }
}
